{
  "lang": "VI",
  "Timeline.Now": "Hiện tại",
  "Button.Return": "Về trang chủ",

  "Navbar.Works": "Dự Án",
  "Navbar.Source": "Mã Nguồn",

  "Sidebar.About": "Tiểu Sử",
  "Sidebar.Works": "Dự Án Đã Làm",
  "Sidebar.Source": "Xem Mã Nguồn",

  "Home.Greeting": "Chào mừng đến với sơ yếu lý lịch của tôi!",
  "Home.Description": "Curious hobbyist - Chế tạo, Thiết kế, Lập trình",
  "Home.Bio.Title": "Tiểu sử",
  "Home.Bio.Content": "Từ một nhà sản xuất đến một thợ điện, một nhà thiết kế đến một lập trình viên, tôi luôn cố xây dựng bản thân một cách cân bằng. Tôi sinh ra và lớn lên tại Hà Nội, Việt Nam và hiện đang học tập tại Mikkeli, Phần Lan. Với niềm đam mê xây dựng các ứng dụng thú vị, tôi luôn đam mê khám phá những điều tân tiến nhất của công nghệ. Khi không làm việc, tôi thường trên Github và LinkedIn học hỏi, giao lưu hoặc lấy cảm hứng.",
  "Home.Works.Button": "Dự Án Đã Làm",
  "Home.Timeline.Title": "Dòng thời gian",
  "Home.Timeline.Content.02": "Sinh ra tại Hà Nội, Việt Nam",
  "Home.Timeline.Content.02.Description": "Nơi mọi hy vọng và ước mơ bắt đầu.",
  "Home.Timeline.Content.14": "Viết dòng mã đầu tiên trên máy tính của chị tôi",
  "Home.Timeline.Content.14.Description": "Bắt nguồn từ thú vui trỉnh sửa trò chơi điện tử, tôi thấy lập trình là cách đơn giản nhất để hiện thực hóa đam mê. Tràn đầy phấn khích, tôi quyết định dành thời gian để học những thứ cơ bản nhất về Lua.",
  "Home.Timeline.Content.17.1": "Lần đầu có được máy tính cá nhân",
  "Home.Timeline.Content.17.1.Description": "Có thể cho rằng, đây là một trong những thứ đáng tiền nhất mà tôi từng mua. Tôi vẫn nhớ mình đã dành cả đêm chỉ để cài Windows.",
  "Home.Timeline.Content.17.2": "Thử nghiệm với bộ vi điều khiển nhúng và C / C++",
  "Home.Timeline.Content.17.2.Description": "Đây là một trong những quyết định quan trọng nhất trong sự nghiệp của tôi. Qua vô số lần vi mạch bị ngắn mạch và quá áp, tôi đã biết cần trân trọng các kỹ sư đằng sau mỗi thiết bị điện tử.",
  "Home.Timeline.Content.17.3": "Lấn chân vào thế giới Internet Vạn Vật (ESP32 và ESP8266)",
  "Home.Timeline.Content.17.3.Description": "Với sự hiểu biết cơ bản về C / C ++ thông qua Arduino, hệ thống sinh thái IoT của Espressif (ESP-IDF) là bước tiến tiếp theo của tôi.",
  "Home.Timeline.Content.18.1": "Tìm hiểu về các công nghệ cơ bản của Web 2.0 (HTML tĩnh và CSS)",
  "Home.Timeline.Content.18.1.Description": "Bước đầu của tôi vào môi trường phát triển web.",
  "Home.Timeline.Content.18.2": "Khám phá những năng lực vô vàn của PHP và jQuery",
  "Home.Timeline.Content.18.2.Description": "Đây là một bước ngoặt quan trọng trong góc nhìn của tôi về các ứng dụng web.",
  "Home.Timeline.Content.18.3": "Lần đầu tiên tạo ra RESTful API và cơ sở dữ liệu MariaDB",
  "Home.Timeline.Content.18.4": "Hiểu được căn bản của việc salting và hashing",
  "Home.Timeline.Content.18.4.Description": "Mặc dù chưa bao giờ quan tâm nhiều đến an ninh và mật mã học, nhưng điều này đã dạy cho tôi tầm quan trọng của việc salting và hashing thông tin như tuyến phòng thủ cuối cùng.",
  "Home.Timeline.Content.19": "Khám phá thế giới của Node.js và các JavaScript framework",
  "Home.Timeline.Content.19.Description": "Luôn muốn cải thiện năng suất, tốc độ và khả năng mở rộng ứng dụng của mình, tôi nhận của nhiều người dùng thử Node.js và thế giới đa dạng của các JavaScript framework.",
  "Home.Timeline.Content.20.1": "Học React và React Native",
  "Home.Timeline.Content.20.1.Description": "Vì nhận thấy sự gia tăng mạnh về độ phổ biến của Ứng dụng web tiến bộ (PWA) và thời gian rảnh trong mùa dịch, tôi thấy React và React Native là những bước tiến hợp lý nhất.",
  "Home.Timeline.Content.20.2": "Mày mò với Next.js",
  "Home.Timeline.Content.20.2.Description": "Ấn tượng bởi các trang kết xuất phía máy chủ của Next.js và sự linh hoạt của chúng, tôi rất muốn tìm hiểu thêm và sử dụng chúng trong hành trang của mình.",
  "Home.Timeline.Content.21.1": "Bắt đầu Chương trình Cử nhân Kinh doanh Quốc tế tại Đại học Aalto",
  "Home.Timeline.Content.21.1.Description": "Bắt đầu bằng Cử nhân Kinh doanh Quốc tế đã cho tôi vô số cơ hội để phát triển bản thân và gặp gỡ những người đến từ nhiều hoàn cảnh khác nhau, giúp tôi hoàn thiện những thiếu sót của bản thân.",
  "Home.Timeline.Content.21.2": "Thử nghiệm OpenCV và mày mò với Computer Vision",
  "Home.Timeline.Content.21.3": "Gia nhập Hacklab Mikkeli",
  "Home.Timeline.Content.21.3.Description": "Một cộng đồng dành cho những người quan tâm đến khoa học, công nghệ và nghệ thuật gặp gỡ, giao lưu và theo đuổi giấc mơ.",
  "Home.Timeline.Content.22": "Bắt đầu xây dựng sơ yếu lý lịch",
  "Home.Timeline.Content.22.Description": "Kỳ nghỉ xuân là một cơ hội tuyệt vời để tôi nhìn lại và suy ngẫm về những gì đã học được trong suốt các vừa năm qua.",
  "Home.Hobbies.Title": "Đam mê",
  "Home.Hobbies.1": "Âm Nhạc",
  "Home.Hobbies.2": "Chế Tạo",
  "Home.Hobbies.3": "Học Hỏi",
  "Home.Hobbies.4": "Khám phá",
  "Home.Hobbies.5": "Trí Tuệ Nhân Tạo",
  "Home.Social.Title": "Các nền tảng khác",

  "Works.Title": "Dự án",

  "Works.Web.Title": "Ứng dụng Web",
  "Works.Web.Badge.Demo": "Trải Nghiệm",
  "Works.Web.Badge.Platform": "Nền Tảng",
  "Works.Web.Badge.Stack": "Công Nghệ",
  "Works.Web.Badge.Backend": "Backend",
  "Works.Web.Platform.Description": "Ứng dụng Web, đa nền tảng",

  "Works.Web.Ambersbakery.Lifespan": "Tháng 1 - 6, 2021",
  "Works.Web.Ambersbakery.Title": "Amber's Bakery",
  "Works.Web.Ambersbakery.Description": "Tiệm bánh online kết hợp với hệ thống số giúp kiểm soát linh hoạt đơn hàng, mặt hàng, và nhân lực.",
  "Works.Web.Ambersbakery.Management": "Hệ thống kiểm soát",
  "Works.Web.Stickynote.Lifespan": "Tháng 3, 2021",
  "Works.Web.Stickynote.Title": "Sticky Note",
  "Works.Web.Stickynote.Description": "Ứng dụng web chuyên lưu trữ thông tin nhỏ gọn, đa nền tảng, và luôn đồ bộ hóa.",
  "Works.Web.khanhsportfolio.Lifespan": "Tháng 3, 2022",
  "Works.Web.khanhsportfolio.Title": "Khánh's portfolio",
  "Works.Web.khanhsportfolio.Description": "Sơ yếu lý lịch web đa tương thích, bản địa hóa, và thông dịch linh hoạt.",

  "404.Title": "Rất tiếc",
  "404.Description": "Trang web bạn đang tìm không tồn tại.",

  "Works.Experimental": "Đang thí nghiệm",

  "Footer": "Làm với ❤️ bởi"
}
